Revit 2024 API
PlanTopology Members
The PlanTopology type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRoomIds
Retrieves room ElementIds of the PlanTopology in the last phase.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Circuits
The Circuits of the PlanTopology.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Level
The Level of the PlanTopology.
Phase
The phase of the PlanTopology.
See Also
PlanTopology Class
Autodesk.Revit.DB Namespace